IDEA Open Model
BeamDataEc2.TypeOfCalculation Property
Compatible with IDEA StatiCa Beta 20.0
 there are several types of calculation
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public TypeOfCalculationDeflection TypeOfCalculation { get; set; }
Public Property TypeOfCalculation As TypeOfCalculationDeflection
	Get
	Set
Property Value
Type: TypeOfCalculationDeflection
See Also
Reference
BeamDataEc2 Class
IdeaRS.OpenModel.Concrete Namespace